## Importing panda

In [2]:
import pandas as pd

In [ ]:
## Importing a data file into a panda dataframe

In [4]:
Age_mothers_raw = pd.read_csv('SF_2_3_Age_mothers_childbirth.csv')

In [ ]:
## Investigating a dataframe and cleaning data

In [ ]:
Age_mothers_raw.info()

## from info() I've learned that there are 51 rows and 94 columns of data

In [7]:
Age_mothers_raw.iloc[0:5, :]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 84,Unnamed: 85,Unnamed: 86,Unnamed: 87,Unnamed: 88,Unnamed: 89,Unnamed: 90,Unnamed: 91,Unnamed: 92,Unnamed: 93
0,Country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,OECD-Average,..,..,..,..,..,..,..,..,..,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Australia,27.5,27.5,27.5,27.5,27.5,27.4,27.3,27.3,27.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Austria,27.6,27.5,27.5,27.4,27.4,27.3,27.1,27.0,26.8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Belgium,28.0,27.9,27.9,27.8,27.7,27.6,27.5,27.4,27.3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Observations:
## 1. could firt row be used for column index and first column as row index
## 2. looking at the first few rows I determined that there are some null values and the question was is if some of the rows/columns could be discarded

In [ ]:
## 1. setting firt row for column index and first column as row index

In [41]:
Age_mothers_df.columns=Age_mothers_df.iloc[0]

In [ ]:
Age_mothers_df

In [ ]:
Age_mothers_raw.isnull().sum()

In [ ]:
Null_info.iloc[50:89]

In [30]:
Age_mothers_df = Age_mothers_raw.iloc[0:52,0:62]

In [ ]:
## 1. checking for columns with Null values that can be discarded

In [11]:
Null_info = Age_mothers_raw.isnull().sum()

In [ ]:
Null_info

## from column 62 all data elements are null